{
  "diff":{
      "zero":{
        "con": "making tea",
        "abs": "solvte molecules move from higher solute concentration side to the lower",
        "A": {
          "0": "How can making tea relate to this experiment?",
          "1": "What are the basic ingredients you need to make tea?",
          "2": "Which equipment is similar to the ingredient you need in making tea?",
          "3": "U-tube with Water is essential in making tea. It is the first equipment you need."
        },
        "S": {
          "0": "Think about the relations to making tea.",
          "1": "Think about the basic ingredients you need to make tea. ",
          "2": "Think about the equipment that is similar to the ingredient you need in making tea.",
          "3": "U-tube with Water is essential in making tea. It is the first equipment you need."
        },
        "I": {
          "0": "How can molecules move from higher concentration to lower concentration?",
          "1": "How many different molecules are needed to have a difference in concentration?",
          "2": "Which equipment contains molecules in a liquid that can serve as a base?",
          "3": "Water molecules can serve as the base for diffusion. U-tube with Water is the first equipment you need."
        },
        "R": {
          "0": "Think about how molecules move from higher concentration to lower concentration.",
          "1": "Think about how many different molecules are needed to have a difference in concentration.",
          "2": "Think about which equipment contains molecules in a liquid that can serve as a base.",
          "3": "Water molecules can serve as the base for diffusion. U-tube with Water is the first equipment you need."
        }
      },
      "water":{
        "con": "water turn to tea",
        "abs": "change liquid concentration",
        "A": {
          "0": "How can water turn into tea relate to this experiment?",
          "1": "In tea, diffusion occurs when tea leaves is added to water to turn into tea. How can this process be replicated in the experiement? ",
          "2": "Which equipment is similar to the function of tea leaves?",
          "3": "Green/Red dye is comparable to tea leaves. It is added to water to become color water. "
        },
        "S": {
          "0": "Think about the relations to how water turn into tea.",
          "1": "In tea, diffusion occurs when tea leaves is added to water to turn into tea. Think about how this process can be replicated in the experiement. ",
          "2": "Think about which equipment is similar to the function of tea leaves.",
          "3": "Green/Red dye is comparable to tea leaves. It is added to water to become color water. "
        },
        "I": {
          "0": "How can there be a  higher concentration of water molecule?",
          "1": "What can be added in water to create a concentration difference?",
          "2": "Which equipment allows the visual movement of molecules achieving uniform concentration to be seen?",
          "3": "Green/Red dye can be added to water to showcase a visual transformation of diffusion. The water and color dye will mix and become color water."
        },
        "R": {
          "0": "Think about how there is a higher concentration of water molecules. ",
          "1": "Think about what can be added in water to create a concentration difference.",
          "2": "Think about which equipment allows the visual movement of molecules achieving uniform concentration to be seen.",
          "3": "Green/Red dye can be added to water to showcase a visual transformation of diffusion. The water and color dye will mix and become color water."
        }
      },
      "dye":{
        "con": "teabag turn to tea",
        "abs": "higher concentration of solute molecules"
      }
  },
  "osmo":{
      "zero":{
        "con": "plant root absorbing water from the soil",
        "abs": "water molecules moving from low solute concentration side to the higher",
        "A": {
          "0": "What is the similarity of plant root absorbing water from the soil and this experiment?",
          "1": "What are the basic ingredients for plant root absorbing water from the soil?",
          "2": "Which equipment is similar to the basic ingredient you need in this condition?",
          "3": "Water molecules can serve as the base for osmosis. Beaker with water is the first equipment you need."
        },
        "S": {
          "0": "Think about the similarity of plant root absorbing water from the soil and this experiment.",
          "1": "Think about the basic ingredients for plant root absorbing water from the soil.",
          "2": "Think about the equipment that is similar to the basic ingredient you need in this condition.",
          "3": "Water molecules can serve as the base for osmosis. Beaker with water is the first equipment you need."
        },
        "I": {
          "0": "How can the movement of solvent molecules move down the concentration gradient?",
          "1": "Base solvent is the the basic ingredients to produce concentration gradient.",
          "2": "Select the most suitable equipment which can serve as base solvent.",
          "3": "Water molecules can serve as the base for osmosis. Beaker with water is the first equipment you need."
        },
        "R": {
          "0": "Think about the movement of solvent molecules move down the concentration gradient.",
          "1": "Base solvent is the the basic ingredients to produce concentration gradient.",
          "2": "Select the most suitable equipment which can serve as base solvent.",
          "3": "Water molecules can serve as the base for osmosis. Beaker with water is the first equipment you need."
        }
      },
      "utube":{
        "con": "teabag turn to tea",
        "abs": "block the free movement of solute molecule",
        "A": {
          "0": "How does a teabag turn into tea relate to this experiment?",
          "1": "The tea bag don't allow leaf move out the bag, so there is concentration difference.",
          "2": "Which equipment can have the same function as the bag of tea, block the big molecule movement.",
          "3": "Semipermeable membrane can block the free movement of solute molecule, that's what you need."
        },
        "S": {
          "0": "Think about the relations to how a teabag turn into tea.",
          "1": "Think about the tea bag don't allow leaf move out the bag, so there is concentration difference.",
          "2": "Think about which equipment can have the same function as the bag of tea, block the big molecule movement.",
          "3": "Semipermeable membrane can block the free movement of solute molecule, that's what you need."
        },
        "I": {
          "0": "How do solvent and solute molecules act in osmosis?",
          "1": "The solvent can move free in the beaker, how can block free movement of solute.",
          "2": "Which equipment can block free movement of solute molecules?",
          "3": "Semipermeable membrane can block the free movement of solute molecule, that's what you need."
        },
        "R": {
          "0": "Think about how solvent and solute molecules act in osmosis.",
          "1": "The solvent can move free in the beaker, how can block free movement of solute.",
          "2": "Which equipment can block free movement of solute molecules?",
          "3": "Semipermeable membrane can block the free movement of solute molecule, that's what you need."
        }   
      },
      "utubemembrane":{
        "con": "placing a red blood cell in water causes it to burst",
        "abs": "the difference of solute molecules" ,
        "A": {
          "0": "Why does placing a red blood cell in water causes it to burst?",
          "1": "Concentration difference of solute cause the red blood cell burst.",
          "2": "You need to select a suitable solute whcih can not go through semipermeable membrane, to produce Concentration difference.",
          "3": "Salt molecules can not go through semipermeable membrane, it can make concentration difference, that's what you need."
        },
        "S": {
          "0": "Think about the reason why placing a red blood cell in water causes it to burst.",
          "1": "Concentration difference of solute cause the red blood cell burst.",
          "2": "You need to select a suitable solute whcih can not go through semipermeable membrane, to produce Concentration difference.",
          "3": "Salt molecules can not go through semipermeable membrane, it can make concentration difference, that's what you need."
        },
        "I": {
          "0": "Which molecules can not go though the semi-permeable membrane?",
          "1": "Concentration difference of solute is the basis of osmosis.",
          "2": "You need to select a suitable solute whcih can not go through semipermeable membrane, to produce Concentration difference.",
          "3": "Salt molecules can not go through semipermeable membrane, it can make concentration difference, that's what you need."
        },
        "R": {
          "0": "Think about which molecules can not go though the semi-permeable membrane.",
          "1": "Concentration difference of solute is the basis of osmosis.",
          "2": "You need to select a suitable solute whcih can not go through semipermeable membrane, to produce Concentration difference.",
          "3": "Salt molecules can not go through semipermeable membrane, it can make concentration difference, that's what you need."
        }    
      }
  }
}