{
"1":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Transportation is a vital process in plants. Plants need water, minerals, and food for their growth and survival. Water and minerals are taken up by roots and leaves prepare the food. These are then transported to the other parts of the plants."
},
"2":{
    "type": "Reading",
    "label": "Diffusion_Definition",
    "content": "Diffusion is the main pathway of transportation in plants. Diffusion is the movement of molecules from a region of higher concentration to a region of lower concentration down the concentration gradient without the expenditure of energy."
},
"3":{
    "type": "Reading",
    "label": "Diffusion",
    "content": "Diffusion is a very important process for photosynthesis where carbon dioxide from the stomata diffuses into the leaves and finally into the cells. Also, during transpiration, the water and oxygen diffuse from the leaves into the environment."
},
"4":{
    "type": "MCQ",
    "label": "Diffusion",
    "content": "The process of diffusion for liquid is NOT affected by",
    "option_1": "the difference of concentration gradient",
    "option_2": "environment humidity",
    "option_3": "environment temperature",
    "option_4": "size of particle",
    "answer": "2"
},
"5":{
    "type": "MCQ",
    "label": "Diffusion",
    "content": "Which of the following statement about diffusion is wrong?",
    "option_1": "Diffusion occurs everywhere, but mostly in gases and liquids.",
    "option_2": "Diffusion includes the movement of particles from the region of its higher concentration to the region of its lower concentration.",
    "option_3": "The expenditure of energy is necessary in diffusion process.",
    "option_4": "Water are taken by the roots of plants, this is a diffusion process.",
    "answer": "3"
},
"6":{
    "type": "Reading",
    "label": "Diffusion",
    "content": "Diffusion is widely used in various fields such as biology, physics and chemistry. Diffusion can be classified into two main types: free diffusion and facilitated diffusion. Brownian motion is the force behind the diffusion of fluids. "
},
"7":{
    "type": "Reading",
    "label": "Diffusion",
    "content": "Free diffusion is a process in which the substance moves through a semipermeable membrane or in a solution without any help from transport proteins. Facilitated diffusion is a passive movement of molecules across the semipermeable membrane from the region of higher concentration to the region of lower concentration by means of a carrier molecule."
},
"8":{
    "type": "MCQ",
    "label": "Diffusion",
    "content": "Which of the following statement is NOT a example of diffusion?",
    "option_1": "A tea bag immersed in a cup of hot water will diffuse into the water and change its colour.",
    "option_2": "Cold air sinks, hot air rises.",
    "option_3": "Sugar gets dissolved evenly and sweetens the water without having to stir it.",
    "option_4": "A spray of room freshener will get diffused into the air by which we can sense the odour.",
    "answer": "2"
},
"9":{
    "type": "Reading",
    "label": "Diffusion_Osmosis",
    "content": "Since water is solvent in every living being, biologists define osmosis as the diffusion of water across a semipermeable membrane, osmosis is limited only to the liquid medium. For example, plants take minerals from roots with the help of osmosis."
},
"10":{
    "type": "MCQ",
    "label": "Diffusion_Osmosis",
    "content": "Which of the following is wrong regarding free diffusion and osmosis?",
    "option_1": "The temperature is higher, the rate of diffusion is higher.",
    "option_2": "Free diffusion doesn't need energy consumption and carrier.",
    "option_3": "Osmosis need energy consumption.",
    "option_4": "The difference of concentration gradient is higner, the rate of osmosis is higher.",
    "answer": "3"
},
"11":{
    "type": "MCQ",
    "label": "Diffusion_Osmosis",
    "content": "A semipermeable membrane is a layer that only certain molecules can pass through. Which of the following item is NOT a semipermeable membrane?",
    "option_1": "Carbon filter mesh",
    "option_2": "Egg membrane",
    "option_3": "Cellophane",
    "option_4": "Cell membrane",
    "answer": "1"
},
"12":{
    "type": "MCQ",
    "label": "Diffusion_Osmosis",
    "content": "Not every molecule can cross the semipermeable membranes. Which of the following item can NOT diffuse across the semipermeable membrane(e.g., cell membrane)?",
    "option_1": "Glucose",
    "option_2": "Sodium ions",
    "option_3": "Calcium ions",
    "option_4": "All of the above",
    "answer": "4"
},
"13":{
    "type": "MCQ",
    "label": "Diffusion_Osmosis",
    "content": "Osmosis and diffusion are the two different types of passive transport. Which of the following statement is wrong?",
    "option_1": "Osmosis is limited only to the liquid medium. Diffusion occurs in liquid, gas and even solids.",
    "option_2": "The intake of water in plants is an example of osmosis. ",
    "option_3": "Both osmosis and facilitated diffusion require a semipermeable membrane.",
    "option_4": "Osmosis helps in the uptake of minerals in plant root.",
    "answer": "4"
},
"14":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Plants contain a vast network of conduits which consist of xylem and phloem, the xylem and phloem tissues extend throughout the plant. These conducting tissues originate from the roots and move up through the trunks of trees. Later they branch off into the branches and then branching even further into every leaf."
},
"15":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Xylem is a long, non-living tube running from the roots to the leaves through the stem. The water is absorbed by the root hair and undergoes cell to cell movement by osmosis until it reaches the xylem. This water is then transported through the xylem vessels to the leaves and is evaporated by the process of transpiration."
},
"16":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "The phloem is responsible for translocation of nutrients and sugar like carbohydrates, produced by the leaves to areas of the plant that are metabolically active.  It is made up of living cells. The cells walls of these cells form small holes at the ends of the cells known as sieve plates."
},
"17":{
    "type": "MCQ",
    "label": "Diffusion_Transport",
    "content": "Xylem and Phloem are two different types of vascular tissues. Which of the following statement is wrong?",
    "option_1": "Xylem cells are considered dead, but phloem cells is live.",
    "option_2": "The movement of phloem is bidirectional(both ways – up and down).",
    "option_3": "The main activity of phloem is to transport minerals and water.",
    "option_4": "Xylem is located in the centre of the vascular bundle.",
    "answer": "3"
},
"18":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Passive absorption(diffusion) is the main way to absorb water in plant roots, water is absorbed due to transpiration pull and it is created due to the stress created in xylem sap. The rate of absorption significantly depends upon the rate of transpiration. The force required for the absorption of water is mainly generated in the mesophyll cells."
},
"19":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Transpiration is the driving force behind uptake and transport of water. It is the process of water evaporation through openings called stomata. This creates a pull by replacing the water that has evaporated. This pull in the xylem tissues extends all the way down due to the cohesive forces. This negative water pressure that occurs in the roots will eventually result in an increase of water uptake from the soil."
},
"20":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "Transportation in plants is by three means: diffusion, facilitated diffusion and active transport. Active transport pumps molecules against the concentration gradient. Here the energy of ATP is used to drive the pump. The ATP donates a phosphate to a particular gateway molecule which then pumps the desired molecule across the membrane."
},
"21":{
    "type": "Reading",
    "label": "Plants_Transport",
    "content": "The driving forces responsible for the transportation of water and minerals in plants include: transpiration, force of surface tension, water potential gradient and the force of hydrogen bonding between water molecules."
},
"22":{
    "type": "MCQ",
    "label": "Diffusion_Transport",
    "content": "Absorption of minerals in root is (  ), transporation of sugar in phloem is (  ).",
    "option_1": "active transport, active transport",
    "option_2": "facilitated diffusion, active transport",
    "option_3": "active transport, facilitated diffusion",
    "option_4": "diffusion, facilitated diffusion ",
    "answer": "2"
},
"23":{
    "type": "Reading",
    "label": "Plants",
    "content": "Photosynthesis is a process by which produce oxygen and phototrophs convert light energy into chemical energy, which is later used to fuel cellular activities. The chemical energy is stored in the form of sugars, which are created from water and carbon dioxide."
},
"24":{
    "type": "MCQ",
    "label": "Plants",
    "content": "Photosynthesis process is affected by ( )",
    "option_1": "light intensity and the concentration of carbon dioxide",
    "option_2": "temperature",
    "option_3": "water",
    "option_4": "all of the above",
    "answer": "4"
},
"25":{
    "type": "MCQ",
    "label": "Plants",
    "content": "Which of the following is wrong regarding photosynthesis?",
    "option_1": "Photosynthesis serves a crucial role in the food chain, forming the primary producers.",
    "option_2": "Photosynthesis is responsible for the production of oxygen on earth.",
    "option_3": "Increased light intensity results in a lower rate of photosynthesis.",
    "option_4": "Higher concentration of carbon dioxide helps in increasing the rate of photosynthesis.",
    "answer": "3"
},
"26":{
    "type": "Reading",
    "label": "Plants",
    "content": "Respiration is a chain of chemical reactions that enables all living entities to synthesize energy required to sustain. All plants respire to provide energy for their cells to be active or alive, inhalation of oxygen and exhalation of carbon dioxide gas takes place."
},
"27":{
    "type": "MCQ",
    "label": "Plants",
    "content": "Which of the following is wrong regarding respiration process?",
    "option_1": "This process is common to all living things, including plants, animals, birds, etc.",
    "option_2": "Both photosynthesis and respiration stop at night.",
    "option_3": "Energy is released.",
    "option_4": "In many ways, respiration is the opposite of photosynthesis",
    "answer": "2"
}
}